sports = ["football" , "tennis" , "basketball"]
sports.append("vollyball")
print(sports)


sports = ["football" , "tennis" , "basketball"]
print(sports.index("basketball"))


numbers = [1 , 2 ,3 , 4, 5 ,6 , 7 , 8 , 9 , 10 ,11 , 12 ,13 , 14 , 15]
print((len)(numbers))




# davaleba 1 ლისტი შეადგენს 8 4 2 6 მერე წერია რომ  2 წაშალეს და გამოდის 8 4 6 და მერე წერია ლენ ანუ ტერმინალში დაიწერება 3 და მერე უნდა მივუმატოთ 6

#დავ 2 პას 4 იმიტომ რომ ინსერტ რომ დავწერეტ 1 , 3 ანუ რაც ლისტში რაც წერია 1 დაემატება 3 მერე რემუვე რომ წერია გამოაკლებს მაგ ლისტიდან 9 რას  და მერე 0 ადგილას დაწერს 8 და მესამე ელემენტი გამოდის 4