# 1 დავალება: მომხმარებელს შემოატანინეთ სახელი თუ მისი სახელი თუ უდრის თქვენ სახელს მაშინ გამოგვიტანოს True ხოლო სხვა შემთხვევაში False


name = bool(input("enter your name : "))
print(bool("nikoloz"))

# 2 დავალება :  მომხმარებელს შემატანინეთ რიცხვი თუ რიცხვი იყო 0 მეტი და 10 ნაკლები მაშინ დაგვიპრინტოს True ხოლო სხვა შემთხვევაში False

nub = int(input("0>  <10 :"))
print(bool(nub))

# 3 დავალება  : გაკეთეთ 20 მაგალითი შედარებით ოპერატორებზე

print(10 > 7)
print(15 < 7)
print(34 > 23)
print(57 > 49)
print(78 > 900)
print(776564 > 1)
print(78987 > 4 + 3443434)
print(5435465 > 200000000 -4434343 )
print(5554 > 34)
print(2 < 54)
print(35786 > 3443554554644554)
print(765743564735645735472473 < 3)
print(27652435972436572345723467523674526572672672672675021294836242093547854754368774372054976437657456483657845647657834664 < 124236785634756324645356732652436546243)
print(564637643888 + 7465742657436467 > 43326323636268743746367467 - 6435455563146246235462364)
print(636326473264672367432 > 32425)
print(264523645263 - 394734673 > 4455)
print(2656 > 354)
print(89999999999 - 999999999 > 2 + 10000000000000)
print(7 < 2)
print(67 > 67 + 1)
print(4 < 1)
print(243 > 4)